# Panda
#### Panda is an extremely powerfull version of exel. this library allows us to do lot of thing with data.

In [1]:
import pandas as pd

#### series
* A series is similar to a numpy array but its have axis labels instead of  location and its also hold any arbitary python object.

## creating a series with list

In [2]:
import numpy as np

In [3]:
my_list = [1, 2, 3, 4, 5]
# create a label
labels = ['a','b','c','d','e']

In [4]:
# default:
pd.Series(data=my_list) # by default index position have numeric value.

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
# using labels
pd.Series(data=my_list,index=labels) # also write: pd.Series(my_list,labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
list1 = ['A','B','C','D','E']

In [7]:
pd.Series(list1) # its the example of panda's object holding power

0    A
1    B
2    C
3    D
4    E
dtype: object

## using arrays

In [8]:
arr = np.arange(1,4)

In [9]:
pd.Series(arr)

0    1
1    2
2    3
dtype: int32

In [10]:
labels = ['x','y','z']

In [11]:
pd.Series(arr,labels)

x    1
y    2
z    3
dtype: int32

## using dictionary

In [12]:
my_dict = {'k1': 1, "k2": 3, 'k3': 6}

In [13]:
pd.Series(my_dict)

k1    1
k2    3
k3    6
dtype: int64

In [14]:
dict1 = {'name1':'hello', 'name2': 'hi'}

In [15]:
pd.Series(dict1)

name1    hello
name2       hi
dtype: object

## series operation
* operation based off of index

In [16]:
series1 = pd.Series(data = [1,2,3,4], index = ['ami','tumi','se','tini'])

In [17]:
series2 = pd.Series(data= [4,3,2,1], index = ['ami','tumi','uni','tini'])

In [18]:
series1 + series2

ami     5.0
se      NaN
tini    5.0
tumi    5.0
uni     NaN
dtype: float64

In [19]:
series1 * series2

ami     4.0
se      NaN
tini    4.0
tumi    6.0
uni     NaN
dtype: float64

In [20]:
# we can also do other operation. but note that if index position not match up then the output give none value of those not match index

## Panda DataFrame:
* dataframe is the main workhorse of pandas. a dataframe have bunch of series objects, all the series share the same index.

In [61]:
from numpy.random import randn

In [22]:
# creating a dataframe
df = pd.DataFrame(data = randn(5,5), index = 'A B C D E'.split(), columns = 'w x y z m'.split())

In [23]:
df

          w         x         y         z         m
A -0.392974 -1.206416 -0.538267 -0.288817  0.225410
B  0.318997 -1.722572 -1.251399  0.590778 -0.275473
C -0.121300  1.659762  1.161388 -1.338559 -0.002302
D -1.026431  1.013949  0.786805  0.282949 -0.084004
E -2.424890 -0.088391  0.028003 -2.426199  0.236433

#### selection and indexing of DataFrame

#### with respect of column

In [24]:
df['w']

A   -0.392974
B    0.318997
C   -0.121300
D   -1.026431
E   -2.424890
Name: w, dtype: float64

In [25]:
type(df['w']) # we can see that this return a series

pandas.core.series.Series

In [26]:
df['m']

A    0.225410
B   -0.275473
C   -0.002302
D   -0.084004
E    0.236433
Name: m, dtype: float64

In [27]:
# we can also indexing a list of columns
df[['x','y','z']]

          x         y         z
A -1.206416 -0.538267 -0.288817
B -1.722572 -1.251399  0.590778
C  1.659762  1.161388 -1.338559
D  1.013949  0.786805  0.282949
E -0.088391  0.028003 -2.426199

#### with respect of row

In [28]:
df.loc['B']

w    0.318997
x   -1.722572
y   -1.251399
z    0.590778
m   -0.275473
Name: B, dtype: float64

In [29]:
type(df.loc['B']) # its also return a series

pandas.core.series.Series

#### selecting subset of rows and columns

In [30]:
df.loc['A','m']

0.22541048932292604

In [31]:
df.loc[["A",'B'],['w','m']]

          w         m
A -0.392974  0.225410
B  0.318997 -0.275473

#### creating new columns using series operation

In [32]:
df['n'] = df['x'] * df['y']

In [33]:
df

          w         x         y         z         m         n
A -0.392974 -1.206416 -0.538267 -0.288817  0.225410  0.649374
B  0.318997 -1.722572 -1.251399  0.590778 -0.275473  2.155625
C -0.121300  1.659762  1.161388 -1.338559 -0.002302  1.927628
D -1.026431  1.013949  0.786805  0.282949 -0.084004  0.797780
E -2.424890 -0.088391  0.028003 -2.426199  0.236433 -0.002475

#### creating new row using series operetion

In [34]:
df.loc['F'] = df.loc['B'] +  df.loc['C']

In [35]:
df

          w         x         y         z         m         n
A -0.392974 -1.206416 -0.538267 -0.288817  0.225410  0.649374
B  0.318997 -1.722572 -1.251399  0.590778 -0.275473  2.155625
C -0.121300  1.659762  1.161388 -1.338559 -0.002302  1.927628
D -1.026431  1.013949  0.786805  0.282949 -0.084004  0.797780
E -2.424890 -0.088391  0.028003 -2.426199  0.236433 -0.002475
F  0.197697 -0.062810 -0.090011 -0.747781 -0.277775  4.083253

#### removing column from dataframe

In [36]:
df.drop('n',axis=1)

          w         x         y         z         m
A -0.392974 -1.206416 -0.538267 -0.288817  0.225410
B  0.318997 -1.722572 -1.251399  0.590778 -0.275473
C -0.121300  1.659762  1.161388 -1.338559 -0.002302
D -1.026431  1.013949  0.786805  0.282949 -0.084004
E -2.424890 -0.088391  0.028003 -2.426199  0.236433
F  0.197697 -0.062810 -0.090011 -0.747781 -0.277775

In [37]:
# now if we check the original dataframe we can see 'n' column not remove from dataframe
print(df)

          w         x         y         z         m         n
A -0.392974 -1.206416 -0.538267 -0.288817  0.225410  0.649374
B  0.318997 -1.722572 -1.251399  0.590778 -0.275473  2.155625
C -0.121300  1.659762  1.161388 -1.338559 -0.002302  1.927628
D -1.026431  1.013949  0.786805  0.282949 -0.084004  0.797780
E -2.424890 -0.088391  0.028003 -2.426199  0.236433 -0.002475
F  0.197697 -0.062810 -0.090011 -0.747781 -0.277775  4.083253

In [38]:
# if we want permanently remove any column
df.drop('n', axis = 1, inplace = True)

In [39]:
print(df)

          w         x         y         z         m
A -0.392974 -1.206416 -0.538267 -0.288817  0.225410
B  0.318997 -1.722572 -1.251399  0.590778 -0.275473
C -0.121300  1.659762  1.161388 -1.338559 -0.002302
D -1.026431  1.013949  0.786805  0.282949 -0.084004
E -2.424890 -0.088391  0.028003 -2.426199  0.236433
F  0.197697 -0.062810 -0.090011 -0.747781 -0.277775

#### removing row from dataframe

In [40]:
df.drop('F', axis = 0)

          w         x         y         z         m
A -0.392974 -1.206416 -0.538267 -0.288817  0.225410
B  0.318997 -1.722572 -1.251399  0.590778 -0.275473
C -0.121300  1.659762  1.161388 -1.338559 -0.002302
D -1.026431  1.013949  0.786805  0.282949 -0.084004
E -2.424890 -0.088391  0.028003 -2.426199  0.236433

In [41]:
# here also we can see row does't remove from original dataframe
df

          w         x         y         z         m
A -0.392974 -1.206416 -0.538267 -0.288817  0.225410
B  0.318997 -1.722572 -1.251399  0.590778 -0.275473
C -0.121300  1.659762  1.161388 -1.338559 -0.002302
D -1.026431  1.013949  0.786805  0.282949 -0.084004
E -2.424890 -0.088391  0.028003 -2.426199  0.236433
F  0.197697 -0.062810 -0.090011 -0.747781 -0.277775

In [42]:
# for permanent remove of any row
df.drop('F', axis = 0, inplace = True)

In [43]:
df

          w         x         y         z         m
A -0.392974 -1.206416 -0.538267 -0.288817  0.225410
B  0.318997 -1.722572 -1.251399  0.590778 -0.275473
C -0.121300  1.659762  1.161388 -1.338559 -0.002302
D -1.026431  1.013949  0.786805  0.282949 -0.084004
E -2.424890 -0.088391  0.028003 -2.426199  0.236433

#### conditional selection

In [44]:
# its same as the numpy selection. return the boolean value
df>0

       w      x      y      z      m
A  False  False  False  False   True
B   True  False  False   True  False
C  False   True   True  False  False
D  False   True   True   True  False
E  False  False   True  False   True

In [45]:
# for getting the true value of the dataframe we can pass the dataframe with the original one
df[df>0] # note that here the false values shown as NaN values

          w         x         y         z         m
A       NaN       NaN       NaN       NaN  0.225410
B  0.318997       NaN       NaN  0.590778       NaN
C       NaN  1.659762  1.161388       NaN       NaN
D       NaN  1.013949  0.786805  0.282949       NaN
E       NaN       NaN  0.028003       NaN  0.236433

In [46]:
# we can also seletion over a specified colums
df[df['w']<0]

          w         x         y         z         m
A -0.392974 -1.206416 -0.538267 -0.288817  0.225410
C -0.121300  1.659762  1.161388 -1.338559 -0.002302
D -1.026431  1.013949  0.786805  0.282949 -0.084004
E -2.424890 -0.088391  0.028003 -2.426199  0.236433

In [47]:
# we get another column or columns with the basis of a column conditional selection
df[df['w']>0]['m']

B   -0.275473
Name: m, dtype: float64

In [48]:
df[df['w']>0][['z','m']]

          z         m
B  0.590778 -0.275473

#### using logical operator(&,|)

In [49]:
df[(df['w']>0) & (df['m']<1)]

          w         x         y         z         m
B  0.318997 -1.722572 -1.251399  0.590778 -0.275473

In [50]:
df[(df['w']>0) | (df['m']<1)]

          w         x         y         z         m
A -0.392974 -1.206416 -0.538267 -0.288817  0.225410
B  0.318997 -1.722572 -1.251399  0.590778 -0.275473
C -0.121300  1.659762  1.161388 -1.338559 -0.002302
D -1.026431  1.013949  0.786805  0.282949 -0.084004
E -2.424890 -0.088391  0.028003 -2.426199  0.236433

#### creating columns using list

In [51]:
df['new'] = 'a b c d e'.split()

In [52]:
df

          w         x         y         z         m new
A -0.392974 -1.206416 -0.538267 -0.288817  0.225410   a
B  0.318997 -1.722572 -1.251399  0.590778 -0.275473   b
C -0.121300  1.659762  1.161388 -1.338559 -0.002302   c
D -1.026431  1.013949  0.786805  0.282949 -0.084004   d
E -2.424890 -0.088391  0.028003 -2.426199  0.236433   e

#### some index function

In [53]:
df.reset_index() # default index

  index         w         x         y         z         m new
0     A -0.392974 -1.206416 -0.538267 -0.288817  0.225410   a
1     B  0.318997 -1.722572 -1.251399  0.590778 -0.275473   b
2     C -0.121300  1.659762  1.161388 -1.338559 -0.002302   c
3     D -1.026431  1.013949  0.786805  0.282949 -0.084004   d
4     E -2.424890 -0.088391  0.028003 -2.426199  0.236433   e

In [54]:
df.set_index('new')

            w         x         y         z         m
new
a   -0.392974 -1.206416 -0.538267 -0.288817  0.225410
b    0.318997 -1.722572 -1.251399  0.590778 -0.275473
c   -0.121300  1.659762  1.161388 -1.338559 -0.002302
d   -1.026431  1.013949  0.786805  0.282949 -0.084004
e   -2.424890 -0.088391  0.028003 -2.426199  0.236433

In [55]:
# this change is not permanent
df

          w         x         y         z         m new
A -0.392974 -1.206416 -0.538267 -0.288817  0.225410   a
B  0.318997 -1.722572 -1.251399  0.590778 -0.275473   b
C -0.121300  1.659762  1.161388 -1.338559 -0.002302   c
D -1.026431  1.013949  0.786805  0.282949 -0.084004   d
E -2.424890 -0.088391  0.028003 -2.426199  0.236433   e

In [56]:
# for permanent change
# run: df.set_index('new',inplace = True)

#### multi index and index hierarcht

In [58]:
outside_index = ['A','A','B','B']
inside_index = [1,2,1,2]
new_index = list(zip(outside_index,inside_index))
main_index = pd.MultiIndex.from_tuples(new_index)

In [59]:
new_index

[('A', 1), ('A', 2), ('B', 1), ('B', 2)]

In [60]:
main_index

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1),
            ('B', 2)],
           )

In [63]:
df = pd.DataFrame(randn(4,2), index = main_index, columns = ['x','y'])

In [64]:
df

            x         y
A 1 -0.106993  1.300005
  2 -0.805910  0.649331
B 1 -1.801886 -0.318862
  2  0.135255  0.333274

In [65]:
df.loc['A']

          x         y
1 -0.106993  1.300005
2 -0.805910  0.649331

In [66]:
df.loc['B']

          x         y
1 -1.801886 -0.318862
2  0.135255  0.333274

In [67]:
# we can all the operation using this dataframe

## missing data in dataframe
* here we can customize our data frame

In [88]:
# create a dataframe of nan values
data = {'A':[np.nan,4,np.nan],'B':[3,6,3],'C':[np.nan,4,9]}
df = pd.DataFrame(data)

In [89]:
df

     A  B    C
0  NaN  3  NaN
1  4.0  6  4.0
2  NaN  3  9.0

In [90]:
# removing NaN values from dataframe
df.dropna() # its remove all the row which have NaN values

     A  B    C
1  4.0  6  4.0

In [92]:
df.dropna(axis=1) # its remove all the column which have NaN value

   B
0  3
1  6
2  3

In [91]:
df.dropna(thresh = 2) # its remove the row which have two NaN value

     A  B    C
1  4.0  6  4.0
2  NaN  3  9.0

In [93]:
# we fill the NaN values using
df.fillna('hello') # by passing the argument we want. note this change is not permanent.

       A  B      C
0  hello  3  hello
1      4  6      4
2  hello  3      9

In [94]:
df

     A  B    C
0  NaN  3  NaN
1  4.0  6  4.0
2  NaN  3  9.0

In [95]:
df.fillna(100)

       A  B      C
0  100.0  3  100.0
1    4.0  6    4.0
2  100.0  3    9.0

In [96]:
# try
df['C'].fillna(df['C'].mean())

0    6.5
1    4.0
2    9.0
Name: C, dtype: float64